
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 6 to change, 2 to destroy.</code></pre>

* Update
  * azurerm_api_management_subscription.product[0]
  * module.action-group.azurerm_resource_group_template_deployment.action-group
  * module.apim_product[0].azurerm_api_management_product.product
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects_trigger_once
  * module.sa.azurerm_storage_account.storage_account
* Replace
  * azurerm_storage_blob.b2c_policy_files[&#34;reset-pw-en.html&#34;]
  * azurerm_storage_blob.b2c_policy_files[&#34;reset-pw.css&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.product[0] will be updated in-place
  ~ resource "azurerm_api_management_subscription" "product" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/subscriptions/d5a0ba59-f5ac-4e05-9650-2e5734c17e29"
        # (8 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_policy_files["reset-pw-en.html"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_policy_files" {
      ~ access_tier            = "Cool" -> (known after apply)
      - content_md5            = "c9404b25cd96fb62ddc13e23fdc542f1" -> null # forces replacement
      ~ id                     = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/reset-pw-en.html" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "reset-pw-en.html"
      ~ url                    = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/reset-pw-en.html" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_policy_files["reset-pw.css"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_policy_files" {
      ~ access_tier            = "Cool" -> (known after apply)
      - content_md5            = "719bb24edcb603d5170322ba62e2bea5" -> null # forces replacement
      ~ id                     = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/reset-pw.css" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "reset-pw.css"
      ~ url                    = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/reset-pw.css" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Resources/deployments/CaTH-Group"
        name                = "CaTH-Group"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.apim_product[0].azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/products/pip-product-stg"
      ~ subscriptions_limit   = 0 -> 20
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_schedule.client_serects will be updated in-place
  ~ resource "azurerm_automation_schedule" "client_serects" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/schedules/rotate-client-secrets-schedule"
        name                    = "rotate-client-secrets-schedule"
      ~ start_time              = "2024-03-26T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_schedule.client_serects_trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "client_serects_trigger_once" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/schedules/rotate-client-secrets-schedule-single-trigger"
        name                    = "rotate-client-secrets-schedule-single-trigger"
      ~ start_time              = "2024-03-25T10:50:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.sa.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Storage/storageAccounts/pipsssastg"
        name                              = "pipsssastg"
        tags                              = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (50 unchanged attributes hidden)

      ~ blob_properties {
            # (4 unchanged attributes hidden)

          ~ cors_rule {
              ~ allowed_origins    = [
                    "https://hmctspipnonprod.b2clogin.com",
                  + "https://staff.pip-frontend.staging.platform.hmcts.net",
                  + "https://sign-in.pip-frontend.staging.platform.hmcts.net",
                  + "https://*.pip-frontend.test.platform.hmcts.net",
                  + "https://*.pip-frontend.demo.platform.hmcts.net",
                  + "https://*.pip-frontend.ithc.platform.hmcts.net",
                ]
                # (4 unchanged attributes hidden)
            }
          - cors_rule {
              - allowed_headers    = [
                  - "*",
                ] -> null
              - allowed_methods    = [
                  - "GET",
                  - "OPTIONS",
                ] -> null
              - allowed_origins    = [
                  - "https://staff.pip-frontend.staging.platform.hmcts.net",
                ] -> null
              - exposed_headers    = [
                  - "*",
                ] -> null
              - max_age_in_seconds = 200 -> null
            }
          - cors_rule {
              - allowed_headers    = [
                  - "*",
                ] -> null
              - allowed_methods    = [
                  - "GET",
                  - "OPTIONS",
                ] -> null
              - allowed_origins    = [
                  - "https://sign-in.pip-frontend.staging.platform.hmcts.net",
                ] -> null
              - exposed_headers    = [
                  - "*",
                ] -> null
              - max_age_in_seconds = 200 -> null
            }
          - cors_rule {
              - allowed_headers    = [
                  - "*",
                ] -> null
              - allowed_methods    = [
                  - "GET",
                  - "OPTIONS",
                ] -> null
              - allowed_origins    = [
                  - "https://*.pip-frontend.test.platform.hmcts.net",
                ] -> null
              - exposed_headers    = [
                  - "*",
                ] -> null
              - max_age_in_seconds = 200 -> null
            }
          - cors_rule {
              - allowed_headers    = [
                  - "*",
                ] -> null
              - allowed_methods    = [
                  - "GET",
                  - "OPTIONS",
                ] -> null
              - allowed_origins    = [
                  - "https://*.pip-frontend.demo.platform.hmcts.net",
                ] -> null
              - exposed_headers    = [
                  - "*",
                ] -> null
              - max_age_in_seconds = 200 -> null
            }

            # (2 unchanged blocks hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 6 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":161,"Program":"tfcmt","SHA1":"","Vars":{}} -->